dist/spcalendarpro.min.js

/* SPCalendarPro v1.2.4 | (c) samperrow https://spcalendarpro.sharepointhacks.com */
!function(e,t){e.spcalpro=function(){function e(e,t){return{begin:{beginDateTime:e,beginDate:new Date(e.toDateString()),beginTime:e.toTimeString()},end:{endDateTime:t,endDate:new Date(t.toDateString()),endTime:t.toTimeString()}}}n.prototype.isSameDate=function(){var e=this.userDateTimes.begin.beginDate,t=this.userDateTimes.end.endDate;return this.data=this.data.filter(function(r){return r.EventDate.toDateString()===e&&r.EndDate.toDateString()===t}),this},n.prototype.matchDateTimes=function(){var e=this.userDateTimes.begin.beginDateTime,t=this.userDateTimes.end.endDateTime;return this.data=this.data.filter(function(r){return r.EventDate<=e&&r.EndDate>=t}),this},n.prototype.isTimeConflict=function(){var e=this.userDateTimes.begin.beginDateTime,t=this.userDateTimes.end.endDateTime;return this.data=this.data.filter(function(r){var n=r.EventDate,a=r.EndDate;return e<=n&&t>=a||n<e&&a>e||n<t&&a>t||e<n&&t>a}),this},n.prototype.where=function(e){var t=e.split(" ")[0],r=e.split(" ")[1],n=e.split(r+" ")[1],a={"=":function(e,t){return e==t},">":function(e,t){return e>new Number(t)},"<":function(e,t){return e<new Number(t)},">=":function(e,t){return e>=new Number(t)},"<=":function(e,t){return e<=new Number(t)},"!=":function(e,t){return e!=t}};return this.data=this.data.filter(function(e){return a[r](e[t],n)}),this};var t=function(e,t,r,n){var a=void 0===t.async||t.async;function i(r){var n;return 4==r.readyState&&200==r.status?function(t){{if(t.responseXML)return e.data=s(t.responseXML.querySelectorAll("*"));if(!t.responseXML&&t.responseText){var r=(n=t.responseText.replace(/&#22;|&#0;/g,""),window.ActiveXObject?new ActiveXObject("Microsoft.XMLDOM").loadXML(n):(new DOMParser).parseFromString(n,"application/xml"));return e.data=s(r.querySelectorAll("*"))}}var n}(r):500==r.status&&(n=r,e.error={errorCode:/<errorcode xmlns="http:\/\/schemas.microsoft.com\/sharepoint\/soap\/">/.test(n.responseText)?n.responseText.split('<errorcode xmlns="http://schemas.microsoft.com/sharepoint/soap/">')[1].split("</errorcode>")[0]:"",errorString:/<errorstring xmlns="http:\/\/schemas.microsoft.com\/sharepoint\/soap\/">/.test(n.responseText)?n.responseText.split('<errorstring xmlns="http://schemas.microsoft.com/sharepoint/soap/">')[1].split("</errorstring>")[0]:"",faultString:/<faultstring>/.test(n.responseText)?n.responseText.split("<faultstring>")[1].split("</faultstring>")[0]:""},console.error(e.error),e.error),t.callback?t.callback(e.data,e):e.userCallback?e.userCallback(e.data,e):e}function s(t){for(var r=[],n=0;n<t.length;n++){var a={},i=t[n].attributes;if("z:row"===t[n].nodeName){for(var s=0;s<i.length;s++){var o=i[s].name.split("ows_")[1];a[o]="EventDate"===o||"EndDate"===o?new Date(i[s].value.replace(/-/g,"/")):i[s].value}r.push(a)}}return e.getEventsAfterDate&&(r=r.filter(function(t){return t.EventDate?t.EventDate>=e.getEventsAfterDate:t})),e.getEventsBeforeDate&&(r=r.filter(function(t){return t.EventDate?t.EventDate<=e.getEventsBeforeDate:t})),r}return function(){var e="<soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'><soap:Body><GetListItems xmlns='http://schemas.microsoft.com/sharepoint/soap/'><listName>"+t.listName+"</listName>",s="<DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap>",o="</Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions>",u="",l=t.fields?function(){for(var e="calendar"===r?'<FieldRef Name="fRecurrence"/>':"",n=0;n<t.fields.length;n++)"string"==typeof t.fields[n]&&(e+="<FieldRef Name='"+t.fields[n]+"'/>");return e.length>0?"<viewFields><ViewFields>"+e+"</ViewFields></viewFields>":""}():"";t.CamlQuery?u=t.CamlQuery:"calendar"===r?u="single"===t.type?"<query><Query><Where><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>0</Value></Eq></Where></Query></query>":"recurring"===t.type?"<query><Query><Where><And><DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>1</Value></Eq></And></Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions>":"<query><Query><Where>"+s+o:"list"===r&&""===l&&(u="<viewFields><ViewFields></ViewFields></viewFields>");!function(e){var t=new XMLHttpRequest;{if(t.open("POST",n.soapURL,a),t.setRequestHeader("X-Requested-With","XMLHttpRequest"),t.setRequestHeader("Content-Type",'text/xml;charset="utf-8"'),t.send(e),!0!==a)return i(t);t.onload=function(){return i(t)}}}(e+(u+=l+"</GetListItems>")+"</soap:Body></soap:Envelope>")}(),e.data};String.prototype.formatInputToHours=function(){var e=this.split(" "),t=Number(e[0]);return"PM"===e[1]&&t<12?t+=12:t};function r(e){return e?"function"==typeof e.getMonth?e:new Date(e):null}function n(e,n){this.listName=e.listName?e.listName:null,this.getEventsAfterDate=r(e.getEventsAfterDate),this.getEventsBeforeDate=r(e.getEventsBeforeDate),this.fields=e.fields?e.fields:null,this.userDateTimes=e.userDateTimes?e.userDateTimes:null,this.CamlQuery=e.CamlQuery?e.CamlQuery:null;var a,i,s=(a=e.sourceSite,{year:15===(i=_spPageContextInfo.webUIVersion)?"2013":"2010",soapURL:"string"==typeof a&&a.length>0?a+"/_vti_bin/Lists.asmx":15===i?_spPageContextInfo.webAbsoluteUrl+"/_vti_bin/Lists.asmx":document.location.protocol+"//"+document.location.host+_spPageContextInfo.webServerRelativeUrl+"/_vti_bin/Lists.asmx"});return this.ready=function(e){this.userCallback=e},this.callback=function(){return e.callback?e.callback(this):null},"string"==typeof e.listName?this.data=t(this,e,n,s):console.error("You must specify a list name."),this}return{getCalendarEvents:function(e){return new n(e,"calendar")},getListItems:function(e){return new n(e,"list")},getDateTimesFromForm:function(t,r){var n=function(e,t){function r(e){var t=document.querySelectorAll('input[id$="DateTimeField_DateTimeFieldDate"]')[e].parentNode.parentNode,r=t.getElementsByClassName("ms-dttimeinput")[0];if(r)var n=r.getElementsByTagName("select")[0].value,a=r.getElementsByTagName("select")[1].value;return{date:t.getElementsByTagName("td")[0].getElementsByTagName("input")[0].value,time:function(){return n&&a?n.formatInputToHours()+":"+a:""}}}e=e||0,t=t||1;var n=r(e),a=r(t);return{userBeginDT:new Date(n.date+" "+n.time()),userEndDT:new Date(a.date+" "+a.time())}}(t,r);return e(n.userBeginDT,n.userEndDT)},userDates:function(t,n){return e(r(t),r(n))},disableDragAndDrop:function(){ExecuteOrDelayUntilScriptLoaded(function(){var e=SP.UI.ApplicationPages.CalendarContainerFactory.create;SP.UI.ApplicationPages.CalendarContainerFactory.create=function(t,r,n,a,i){if(r.dataSources&&r.dataSources instanceof Array&&r.dataSources.length>0)for(var s=0;s<r.dataSources.length;s++)r.dataSources[s].disableDrag=!0;e(t,r,n,a,i)}},"SP.UI.ApplicationPages.Calendar.js")}}}()}(this);